# Task 1 - Дана строка. Удалите из нее все гласные буквы.
string1 = 'hello'
vowels = 'aeiouAEIOU'
print(''.join(c for c in string1 if c not in vowels))

# Task 2 - Даны два сета: st1 = {1, 2, 3, 4, 5} st2 = {4, 5, 6, 7, 8}. 
# Получите сет их общих элементов: {4, 5}
st1 = {1, 2, 3, 4, 5}
st2 = {4, 5, 6, 7, 8}
print(st1 & st2)

# Task 2 - Даны два сета: st1 = {1, 2, 3, 4, 5} st2 = {4, 5, 6, 7, 8}.
# Получите сет элементов, входящих только в один из сетов: {1, 2, 3, 6, 7, 8}
st1 = {1, 2, 3, 4, 5}
st2 = {4, 5, 6, 7, 8}
print(st1 ^ st2)