# Task 1 - Дано число. Получите список делителей этого числа.
number1 = 12
print([i for i in range(1, number1 + 1) if number1 % i == 0])

# Task 2 - Выведите в консоль все числа в промежутке от 10 до 1000, 
# у которых первая цифра четная.
print([x for x in range(10, 1001) if int(str(x)[0]) % 2 == 0])

# Task 3 - Дан список: [[1, 2, 3], [4, 5, 6],[7, 8, 9],].
# Найдите сумму элементов этого списка
array1 = [
	[1, 2, 3],
	[4, 5, 6],
	[7, 8, 9],
]
print(sum(map(sum, array1)))

# Task 4 - Дан следующий словарь. Найдите сумму элементов этого словаря.
dct = {
	1: {
		1: 11,
		2: 12,
		3: 13,
	},
	2: {
		1: 21,
		2: 22,
		3: 23,
	},
	3: {
		1: 24,
		2: 25,
		3: 26,
	},
}
total = 0
for value1 in dct.values():
  for value2 in value1.values():
    total += value2
print(total)